#include <iostream>

using namespace std;

int timetable() {
	setlocale(LC_CTYPE, "Russian");
	cout << "\x1b[1;36m Расписание занятий ФИТ 1-2  2 подгруппа" << endl;

	int x;
	char probel;
	probel = ' ';

	while (true) {

		cout << endl << "\x1b[1;36m Выберите день недели 1-понедельник, 2-вторник, 3-среда, 4-четверг, 5-пятница, 6-суббота, 7-воскресенье." << endl;

		cin >> x;

		switch (x)
		{
		case 1: {
			cout << "\x1b[1;34m 14:40-16:00 |  \x1b[1;35m Компьютерные языки разметки(лекция)" << endl;
			cout << "\x1b[1;34m 16:30-17:50 |  \x1b[1;35m Физическая культура и здоровье" << endl;
			cout << "\x1b[1;34m 18:05-19:25 |  \x1b[1;35m Скриптовые языки программирования(лаб. раб.)" << endl;
			cout << "\x1b[1;34m 19:40-21:00 |  \x1b[1;35m Компьютерные языки разметки(лаб. раб.)" << endl;
			break;
		}
		case 2: {
			cout << "\x1b[1;34m 16:30-17:50 |  \x1b[1;35m Математический Анализ(ПЗ)" << endl;
			cout << "\x1b[1;34m 18:05-19:25 |  \x1b[1;35m ТЕхнолигии разработки програмного обеспечения(лекция)" << endl;
			break;
		}
		case 3: {
			cout << "\x1b[1;34m 14:40-16:00 |  \x1b[1;35m Математический Анализ(ПЗ)" << endl;
			cout << "\x1b[1;34m 16:30-17:50 |  \x1b[1;35m Иностранный язык" << endl;
			cout << "\x1b[1;34m 18:05-19:25 |  \x1b[1;35m Линейная алгебра и аналитическая геометрия(лекция)" << endl;
			break;
		}
		case 4: {
			cout << "\x1b[1;34m 14:40-16:00 |  \x1b[1;35m Основы алгоритмизации и программирования(лекция)" << endl;
			cout << "\x1b[1;34m 16:30-17:50 |  \x1b[1;35m Физическая культура и здоровье" << endl;
			cout << "\x1b[1;34m 18:05-19:25 |  \x1b[1;35m Скриптовые языки программирования(лекция)" << endl;
			break;
		}
		case 5: {
			cout << "\x1b[1;34m 14:40-16:00 |  \x1b[1;35m Арифметико-логические основы вычислительных систем(лекция)" << endl;
			cout << "\x1b[1;34m 16:30-17:50 |  \x1b[1;35m Линейная алгебра(ПЗ)" << endl;
			cout << "\x1b[1;34m 18:05-19:25 |  \x1b[1;35m Технологии разработки программного обеспечения(лаб. раб.)" << endl;
			cout << "\x1b[1;34m 19:40-21:00 |  \x1b[1;35m Компьютерные языки разметки(лаб. раб.)" << endl;
			break;
		}
		case 6: {
			cout << "\x1b[1;34m 14:40-16:00 |  \x1b[1;35m Математический анализ(лекция)" << endl;
			break;
		}
		case 7: {
			cout << "\x1b[1;34m00:00-23:59 | \x1b[1;35m Балдёжелогия и кайфарикиграфия " << endl;
			break;
		}
		default:
			cout << "Пу-пу-пу, такого дня нет... \x1b[0m";
			return 0;
		}
	}
}